cases/openfoam.org/rotatingRotorAMI/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform (0 0 0.08);
    }

    inlet2
    {
        type            fixedValue;
        value           uniform (0 0 0.65);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    movingWalls 
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    staticWalls
    {
        type            noSlip;
    }

    AMI1
    {
        type            cyclicAMI;
    }
    AMI2
    {
        type            cyclicAMI;
    }
}


// ************************************************************************* //
